# AddVPAnnotationObject

## Description
Adds the specified annotation object to the specified viewport.

```pascal
FUNCTION AddVPAnnotationObject(
				viewportHandle   : HANDLE;
				annotationHandle : HANDLE): BOOLEAN;
```

```python
def vs.AddVPAnnotationObject(viewportHandle, annotationHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|   |
|annotationHandle|HANDLE|   |

## Version
Availability: from VectorWorks11.0

## Category
* Objects - Groups